lab/course/bottleneck_sync_ml_automation.html
---
title: ""
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-26 Tue 15:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Doe" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbe11f50">1. <span class="todo TODO">TODO</span> Create a jira for this and make subtasks for each</a></li>
<li><a href="#org6a03762">2. bottlenecks</a>
<ul>
<li><a href="#orgfa18aa1">2.1. service.keystore</a>
<ul>
<li><a href="#orgff3732d">2.1.1. working on have jira open</a></li>
</ul>
</li>
<li><a href="#org5ac24c5">2.2. cerner<sub>mustard</sub></a>
<ul>
<li><a href="#org642ac39">2.2.1. look into using grep or diff to get only the following lines:</a></li>
<li><a href="#org6043269">2.2.2. /Users/er046256/git/alva-config/production/cluster.yml</a></li>
<li><a href="#org5bc1997">2.2.3. solution</a></li>
</ul>
</li>
<li><a href="#org4e5e3a7">2.3. Remedy</a>
<ul>
<li><a href="#org14ca094">2.3.1. we have the api key, need to investigate closedstack to see how to leverage it</a></li>
</ul>
</li>
<li><a href="#org0660866">2.4. PR creation</a>
<ul>
<li><a href="#org3879b9f">2.4.1. wait for jenkins implmentation</a></li>
</ul>
</li>
<li><a href="#orgc173eed">2.5. chef client too early issue. ran back through and null out the values</a></li>
<li><a href="#org869b56e">2.6. insert vmware tools removal after chef client runs</a></li>
</ul>
</li>
<li><a href="#org2f64058">3. helpful info that could be inserted in script</a>
<ul>
<li><a href="#orgf112e50">3.1. The summon process has begun</a>
<ul>
<li><a href="#orge4772ee">3.1.1. we could insert closedstack link here</a></li>
</ul>
</li>
<li><a href="#org281efc3">3.2. What is the subnet (ex 170.71.221.0/24)? 137.252.78.0/23</a>
<ul>
<li><a href="#org7a7647e">3.2.1. https://nethawk.cernerasp.com/dc/client_report</a></li>
</ul>
</li>
<li><a href="#org4381624">3.3. What is the vlan? (ex LS5-MT-DVS-IHCUT<sub>170</sub><sub>71</sub><sub>221</sub><sub>0</sub>-24) samtaz|rhoAppProfile|Web</a>
<ul>
<li><a href="#org5c16d59">3.3.1. http://sysappwhq01/vminfo/Search.aspx</a></li>
</ul>
</li>
<li><a href="#orgfdd5ecf">3.4. What is the cluster? (ex LS5ESXB3 - Full) LS3ESXWAS12-ACI - Full</a></li>
<li><a href="#orgb4d4aa3">3.5. The following datacenter should be in all caps.</a></li>
<li><a href="#org4a4a766">3.6. The company name should be copied from the Remedy search bar.</a></li>
<li><a href="#org449b214">3.7. What is the hostname for the database (ex ihcutdb11)? samtazdb11</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe11f50" class="outline-2">
<h2 id="orgbe11f50"><span class="section-number-2">1</span> <span class="todo TODO">TODO</span> Create a jira for this and make subtasks for each</h2>
</div>




<div id="outline-container-org6a03762" class="outline-2">
<h2 id="org6a03762"><span class="section-number-2">2</span> bottlenecks</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgfa18aa1" class="outline-3">
<h3 id="orgfa18aa1"><span class="section-number-3">2.1</span> service.keystore</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgff3732d" class="outline-4">
<h4 id="orgff3732d"><span class="section-number-4">2.1.1</span> working on have jira open</h4>
</div>
</div>

<div id="outline-container-org5ac24c5" class="outline-3">
<h3 id="org5ac24c5"><span class="section-number-3">2.2</span> cerner<sub>mustard</sub></h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org642ac39" class="outline-4">
<h4 id="org642ac39"><span class="section-number-4">2.2.1</span> look into using grep or diff to get only the following lines:</h4>
</div>
<div id="outline-container-org6043269" class="outline-4">
<h4 id="org6043269"><span class="section-number-4">2.2.2</span> /Users/er046256/git/alva-config/production/cluster.yml</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ol class="org-ol">
<li><a id="org15e0782"></a>desired output<br />
<div class="outline-text-5" id="text-2-2-2-1">
<p>
chef<sub>environment</sub>: sync<sub>ml</sub><sub>production</sub>
node<sub>groups</sub>:
  b1835.cgf<sub>ny.cernerasp.com</sub><sub>chart</sub>:
</p>
<ul class="org-ul">
<li>cgfnysync06.cernerasp.com</li>
</ul>
<p>
b1835.cgf<sub>ny.cernerasp.com</sub><sub>mplus</sub>:
</p>
<ul class="org-ul">
<li>cgfnysync05.cernerasp.com</li>
</ul>
<p>
chef<sub>tags</sub>:
  b1835.cgf<sub>ny.cernerasp.com</sub><sub>chart</sub>:
</p>
<ul class="org-ul">
<li>rho</li>
<li>non-prod</li>
</ul>
<p>
b1835.cgf<sub>ny.cernerasp.com</sub><sub>mplus</sub>:
</p>
<ul class="org-ul">
<li>rho</li>
<li>non-prod</li>
</ul>
<p>
run<sub>lists</sub>:
  b1835.cgf<sub>ny.cernerasp.com</sub><sub>chart</sub>:
</p>
<ul class="org-ul">
<li>role[sync<sub>ml</sub><sub>chart</sub><sub>b1835</sub><sub>cgf</sub><sub>ny</sub><sub>cernerasp</sub><sub>com</sub>]</li>
</ul>
<p>
b1835.cgf<sub>ny.cernerasp.com</sub><sub>mplus</sub>:
</p>
<ul class="org-ul">
<li>role[sync<sub>ml</sub><sub>mplus</sub><sub>b1835</sub><sub>cgf</sub><sub>ny</sub><sub>cernerasp</sub><sub>com</sub>]</li>
</ul>
<p>
b186.usc<sub>ca.cernerasp.com</sub><sub>chart</sub>:
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org5bc1997" class="outline-4">
<h4 id="org5bc1997"><span class="section-number-4">2.2.3</span> solution</h4>
<div class="outline-text-4" id="text-2-2-3">
</div>
<ol class="org-ol">
<li><a id="orgbe324b7"></a>reformat the file<br />
<div class="outline-text-5" id="text-2-2-3-1">
<p>
awk &rsquo;(  <i>chef\<sub>environment</sub></i> || <i>node\<sub>groups</sub></i> || <i>chef\<sub>tags</sub></i> || <i>run\<sub>lists</sub></i> || <i>cgfny</i> || <i>cgf<sub>ny</sub></i> || <i>\ rho</i> || <i>\ non&#x00ad;prod</i> || <i>&#x00ad;&#x00ad;</i> )&rsquo; &gt; updatedfile
</p>

<p>
awk &rsquo;<i>&#x00ad;&#x00ad;/{c++; if (c==3) { sub(&ldquo;&#x00ad;&#x00ad;&rdquo;,&ldquo;run<sub>lists</sub>\:&rdquo;)}}1&rsquo; updatedfile &gt; temp &amp;&amp; mv temp updatedfile
awk &rsquo;</i>&#x00ad;&#x00ad;<i>{c++; if (c==2) { sub(&ldquo;&#x00ad;&#x00ad;&rdquo;,&ldquo;&rdquo;)}}1&rsquo; updatedfile &gt; temp &amp;&amp; mv temp updatedfile
awk &rsquo;</i>&#x00ad;&#x00ad;/{c++; if (c==1) { sub(&ldquo;&#x00ad;&#x00ad;&rdquo;,&ldquo;chef<sub>tags</sub>\:&rdquo;)}}1&rsquo; updatedfile &gt; temp &amp;&amp; mv temp updatedfile
</p>

<p>
awk &rsquo;BEGIN{printf(&ldquo;\n&rdquo;)}1&rsquo; updatedfile &gt; temp &amp;&amp; mv temp updatedfile
awk &rsquo;BEGIN{printf(&ldquo;node<sub>groups</sub>:&rdquo;)}1&rsquo; updatedfile &gt; temp &amp;&amp; mv temp updatedfile
awk &rsquo;BEGIN{printf(&ldquo;\n&rdquo;)}1&rsquo; updatedfile &gt; temp &amp;&amp; mv temp updatedfile
awk &rsquo;BEGIN{printf(&ldquo;chef<sub>environment</sub>: sync<sub>ml</sub><sub>production</sub>&rdquo;)}1&rsquo; updatedfile &gt; temp &amp;&amp; mv temp updatedfile
</p>

<p>
cat updatedfile | grep &rsquo;&sect;&rsquo; &gt; cluster<sub>b1835.yml</sub> &amp;&amp; rm updatedfile
<b>**</b>
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org4e5e3a7" class="outline-3">
<h3 id="org4e5e3a7"><span class="section-number-3">2.3</span> Remedy</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org14ca094" class="outline-4">
<h4 id="org14ca094"><span class="section-number-4">2.3.1</span> we have the api key, need to investigate closedstack to see how to leverage it</h4>
</div>
</div>


<div id="outline-container-org0660866" class="outline-3">
<h3 id="org0660866"><span class="section-number-3">2.4</span> PR creation</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org3879b9f" class="outline-4">
<h4 id="org3879b9f"><span class="section-number-4">2.4.1</span> wait for jenkins implmentation</h4>
</div>
</div>

<div id="outline-container-orgc173eed" class="outline-3">
<h3 id="orgc173eed"><span class="section-number-3">2.5</span> chef client too early issue. ran back through and null out the values</h3>
</div>




<div id="outline-container-org869b56e" class="outline-3">
<h3 id="org869b56e"><span class="section-number-3">2.6</span> insert vmware tools removal after chef client runs</h3>
</div>
</div>


<div id="outline-container-org2f64058" class="outline-2">
<h2 id="org2f64058"><span class="section-number-2">3</span> helpful info that could be inserted in script</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf112e50" class="outline-3">
<h3 id="orgf112e50"><span class="section-number-3">3.1</span> The summon process has begun</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Waiting 30 Minutes for summon process for automatic ping testing.
</p>
</div>
<div id="outline-container-orge4772ee" class="outline-4">
<h4 id="orge4772ee"><span class="section-number-4">3.1.1</span> we could insert closedstack link here</h4>
<div class="outline-text-4" id="text-3-1-1">
</div>
<ol class="org-ol">
<li><a id="org901bd24"></a><a href="https://closedstack.cernerasp.com/users/ER046256">https://closedstack.cernerasp.com/users/ER046256</a><br /></li>
<li><a id="org5eab0c1"></a>or we could take this info:<br />
<div class="outline-text-5" id="text-3-1-1-2">
<p>
I, [2020-05-26T15:31:55.310547 #11328]  INFO &#x2013; summon: Virtual provision job(b789bb1c-ba3e-4be8-8b76-53fdae9a2e46) has been started.
I, [2020-05-26T15:31:55.311380 #11328]  INFO &#x2013; summon: Virtual provision job(120ddfe5-1d7e-464c-beef-f64396900309) has been started.
</p>

<p>
and create links based off the job ids
</p>

<p>
<a href="https://closedstack.cernerasp.com/jobs/b789bb1c-ba3e-4be8-8b76-53fdae9a2e46">https://closedstack.cernerasp.com/jobs/b789bb1c-ba3e-4be8-8b76-53fdae9a2e46</a>
</p>

<p>
<a href="https://closedstack.cernerasp.com/jobs/">https://closedstack.cernerasp.com/jobs/</a>&lt;jobid&gt;
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-org281efc3" class="outline-3">
<h3 id="org281efc3"><span class="section-number-3">3.2</span> What is the subnet (ex 170.71.221.0/24)? 137.252.78.0/23</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org7a7647e" class="outline-4">
<h4 id="org7a7647e"><span class="section-number-4">3.2.1</span> <a href="https://nethawk.cernerasp.com/dc/client_report">https://nethawk.cernerasp.com/dc/client_report</a></h4>
</div>
</div>

<div id="outline-container-org4381624" class="outline-3">
<h3 id="org4381624"><span class="section-number-3">3.3</span> What is the vlan? (ex LS5-MT-DVS-IHCUT<sub>170</sub><sub>71</sub><sub>221</sub><sub>0</sub>-24) samtaz|rhoAppProfile|Web</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org5c16d59" class="outline-4">
<h4 id="org5c16d59"><span class="section-number-4">3.3.1</span> <a href="http://sysappwhq01/vminfo/Search.aspx">http://sysappwhq01/vminfo/Search.aspx</a></h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
&lt;was nodename&gt;%
</p>
</div>
<ol class="org-ol">
<li><a id="org96ab4e5"></a>port group<br /></li>
</ol>
</div>
</div>

<div id="outline-container-orgfdd5ecf" class="outline-3">
<h3 id="orgfdd5ecf"><span class="section-number-3">3.4</span> What is the cluster? (ex LS5ESXB3 - Full) LS3ESXWAS12-ACI - Full</h3>
<div class="outline-text-3" id="text-3-4">
<p>
<a href="http://sysappwhq01/vminfo/Search.aspx">http://sysappwhq01/vminfo/Search.aspx</a>
&lt;was nodename&gt;%
</p>
</div>
<ol class="org-ol">
<li><a id="org9e1f1a7"></a>cluster<br /></li>
</ol>
</div>

<div id="outline-container-orgb4d4aa3" class="outline-3">
<h3 id="orgb4d4aa3"><span class="section-number-3">3.5</span> The following datacenter should be in all caps.</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<ol class="org-ol">
<li><a id="org132a4c7"></a>DC will be in cluster name, if not:<br />
<div class="outline-text-5" id="text-3-5-0-1">
<p>
<a href="https://puma.cernerasp.com/">https://puma.cernerasp.com/</a>
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org4a4a766" class="outline-3">
<h3 id="org4a4a766"><span class="section-number-3">3.6</span> The company name should be copied from the Remedy search bar.</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<ol class="org-ol">
<li><a id="orgdb9937e"></a><a href="https://remedy.cerner.com/arsys/forms/remedyappkc/SHR%3ALandingConsole/Default+Administrator+View/?cacheid=92b4aa6d">https://remedy.cerner.com/arsys/forms/remedyappkc/SHR%3ALandingConsole/Default+Administrator+View/?cacheid=92b4aa6d</a><br />
<div class="outline-text-5" id="text-3-6-0-1">
<p>
oneview
</p>
</div>
</li>
</ol>
</div>

<div id="outline-container-org449b214" class="outline-3">
<h3 id="org449b214"><span class="section-number-3">3.7</span> What is the hostname for the database (ex ihcutdb11)? samtazdb11</h3>
<div class="outline-text-3" id="text-3-7">
</div>
<ol class="org-ol">
<li><a id="org25f946e"></a><a href="https://puma.cernerasp.com/">https://puma.cernerasp.com/</a><br /></li>
<li><a id="org38a188b"></a>insert mill domain and search for &ldquo;db&rdquo;<br /></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2020-05-26 Tue 15:49</p>
</div>
</body>
</html>
